from aiogram import types
from loader import dp
from loader import dp,db,  bot


@dp.message_handler(text="🎁 ТАНЛОВДА ИШТИРОК ЭТИШ")
async def bot_echo(message: types.Message):
    id=message.from_user.id
    url=f"botga a'zo boling \n https://t.me/tarjimonuzruenbot?start={id}"
    
    taklif=f"👆 Юқоридаги сизнинг реферал линк/ҳаволангиз. Уни кўпроқ танишларингизга улашинг. Омад"
    
    await message.answer(text=url)
    await message.answer(text=taklif)


@dp.message_handler(text="🎁 Совғалар")
async def sovga(message:types.Message):
    # text=f"📚  УЧҚУДУҚ ТУМАН ҲОКИМЛИГИ КАНАЛИДА НАВБАТДАГИ АЖОЙИБ ТАНЛОВ 📚Кутубхонангиз фондини бебаҳо китоблар билан бойитиш имкони энди фақат сизда бор. Юқори балл тўпланг ва ғолиб бўлинг. "🥇1-ўрин: 📚 Ручкали Қуръони Карим  китоби 📚"🥉3-ўрин: 📚 Алихонтўра Соғунийнинг Тарихи Муҳаммадий 📚""4. 📚  Бахтиёр оила 📚5. 📚  Жаннатдаги соялар📚 ""6. 📚 Лидер шахсияти📚""7. 📚 Атом одатлар 📚""8. 📚  СОС 📚""9. 📚 Этикетнинг олтин китоби 📚""10. 📚 Дафтар ҳошиясидаги битиклар📚""11. 📚 Алкимёгар 📚""12. 📚 Ўткан кунлар  📚""13. 📚 Икки эшик ораси 📚""14. 📚Фарзанднома""Танловда иштирок этиш учун ҳавола орқали ўтинг👇 🥈2-ўрин: 📚 Аҳмад Лутфий Қозончининг Саодат асри қиссалари асари📚"
    text="""
    📚  УЧҚУДУҚ ТУМАН ҲОКИМЛИГИ КАНАЛИДА НАВБАТДАГИ АЖОЙИБ ТАНЛОВ 📚

Кутубхонангиз фондини бебаҳо китоблар билан бойитиш имкони энди фақат сизда бор. 
 Юқори балл тўпланг ва ғолиб бўлинг. 

🥇1-ўрин: 📚 Ручкали Қуръони Карим  китоби 📚

🥈2-ўрин: 📚 Аҳмад Лутфий Қозончининг "Саодат асри қиссалари" асари📚

🥉3-ўрин: 📚 Алихонтўра Соғунийнинг "Тарихи Муҳаммадий"
 📚

4. 📚  Бахтиёр оила 📚

5. 📚  Жаннатдаги соялар📚 

6. 📚 Лидер шахсияти📚

7. 📚 Атом одатлар 📚

8. 📚  СОС 📚

9. 📚 Этикетнинг олтин китоби 📚

10. 📚 Дафтар ҳошиясидаги битиклар📚

11. 📚 Алкимёгар 📚

12. 📚 Ўткан кунлар  📚

13. 📚 Икки эшик ораси 📚

14. 📚Фарзанднома"

Танловда иштирок этиш учун ҳавола орқали ўтинг👇
    """
    await message.answer(text=text)
    

@dp.message_handler(text="💡 Шартлар")
async def sovga(message:types.Message):
    # text=f"📚  УЧҚУДУҚ ТУМАН ҲОКИМЛИГИ КАНАЛИДА НАВБАТДАГИ АЖОЙИБ ТАНЛОВ 📚Кутубхонангиз фондини бебаҳо китоблар билан бойитиш имкони энди фақат сизда бор. Юқори балл тўпланг ва ғолиб бўлинг. "🥇1-ўрин: 📚 Ручкали Қуръони Карим  китоби 📚"🥉3-ўрин: 📚 Алихонтўра Соғунийнинг Тарихи Муҳаммадий 📚""4. 📚  Бахтиёр оила 📚5. 📚  Жаннатдаги соялар📚 ""6. 📚 Лидер шахсияти📚""7. 📚 Атом одатлар 📚""8. 📚  СОС 📚""9. 📚 Этикетнинг олтин китоби 📚""10. 📚 Дафтар ҳошиясидаги битиклар📚""11. 📚 Алкимёгар 📚""12. 📚 Ўткан кунлар  📚""13. 📚 Икки эшик ораси 📚""14. 📚Фарзанднома""Танловда иштирок этиш учун ҳавола орқали ўтинг👇 🥈2-ўрин: 📚 Аҳмад Лутфий Қозончининг Саодат асри қиссалари асари📚"
    text=""" 
    ТАНЛОВ ШАРТЛАРИ

❗️Ушбу танловда ғолиблар (тасодифан) рандом орқали эмас, балки тўплаган балларига қараб аниқланади. 

Баллар қандай тўпланади?
БОТда келтирилган  каналга обуна бўлгач, "Аъзо бўлдим" тугмасини босишингиз билан, сизга махсус реферал линк (ҳавола) берилади. Ўша линк орқали обуна бўлган ҳар бир инсон учун сизга 5 баллдан бериб борилади. Қанча кўп балл йиғсангиз, ғолиб бўлиш имкониятингиз шунча ортиб боради.
(Ўз блог ёки гуруҳларига эга фаоллар ҳам танловда иштирок этишлари мумкин).

⏰ Танлов 6 апрелдан 30 апрелгача давом этади. (Тугаш вақти 21:00)

❗️Диққат! Сунъий (ўлик аккаунтлар қўшган) накрутка ва х.к. лардан фойдаланганлар танловдан четлаштирилади! 

🏅 Фаол бўлинг ва китоблардан бирини ютиб олинг. Ютуқлар кўп ва албатта фойдали. Барчага омад!
Тўплаган балларингиз ва реклама постларингиз юборилган каналлардан скриншотни асраб қўйинг, исбот учун сўралса тақдим этасиз.
    """
    
    await message.answer(text=text)

@dp.message_handler(text="📊 Рейтинг")
async def get_all_users(message: types.Message):
    users = db.select_all_users()
    text=''
    i=1
    print(users)
    for user in users:
        ism=user[1]
        reyting=user[3]
        text=text+f"{i}-o'rin {ism}  •  {reyting} \n"
        i=i+1
    await message.answer(text=text)